tutorials/Lagrangian/rhoPisoTwinParcelFoam/simplifiedSiwek/constant/thermoCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

InjectionModel  ManualInjection;

DragModel       SphereDrag;

DispersionModel StochasticDispersionRAS;

WallInteractionModel StandardWallInteraction;

HeatTransferModel RanzMarshall;

radiation       off;

minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;

rho0            rho0 [ 1 -3 0 0 0 ] 2500;

T0              T0 [ 0 0 0 1 0 ] 300;

cp0             cp0 [ 0 2 -2 -1 0 ] 900;

epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;

f0              f0 [ 0 0 0 0 0 ] 0.5;

coupled         true;

parcelTypeId    1;

interpolationSchemes
{
    rho             cell;
    U               cellPointFace;
    mu              cell;
    T               cell;
    Cp              cell;
}

integrationSchemes
{
    U               Euler;
    T               Analytical;
}

ManualInjectionCoeffs
{
    massTotal       massTotal [ 1 0 0 0 0 ] 0.0001;
    parcelBasisType mass;
    SOI             0;
    positionsFile   thermoCloud1Positions;
    U0              ( 0 0 0 );
    parcelPDF
    {
        pdfType         RosinRammler;
        RosinRammlerPDF
        {
            minValue        5e-06;
            maxValue        0.0005;
            d               ( 5e-05 );
            n               ( 0.5 );
        }
    }
}

StandardWallInteractionCoeffs
{
    e               e [ 0 0 0 0 0 ] 1;
    mu              mu [ 0 0 0 0 0 ] 0;
}

RanzMarshallCoeffs
{
    Pr              Pr [ 0 0 0 0 0 ] 0.7;
}


// ************************************************************************* //
